# SQLAlchemy Tutorial

### 1. Install the package

```
pip install sqlalchemy
```

### 2. Connecting to an existing database

To start interacting with the database we first we need to establish a connection.
```
import sqlalchemy as db
engine = db.create_engine('dialect+driver://user:pass@host:port/db')
```

As SQLite connects to local files, the URL format is slightly different. The “db” portion of the URL is the filename of the database. For a relative file path, this requires three slashes:

```
# sqlite://<nohostname>/<path>
# where <path> is relative:
engine = create_engine('sqlite:///foo.db')
```

And for an absolute file path, the three slashes are followed by the absolute path:

```
# Unix/Mac - 4 initial slashes in total
engine = create_engine('sqlite:////absolute/path/to/foo.db')

# Windows
engine = create_engine('sqlite:///C:\\path\\to\\foo.db')

# Windows alternative using raw string
engine = create_engine(r'sqlite:///C:\path\to\foo.db')
```

To use a SQLite :memory: database, specify an empty URL:

```
engine = create_engine('sqlite://')
```

In [2]:
import sqlalchemy as db
import pandas as pd

Download database file

In [3]:
##!curl -o lec3_census.sqlite https://github.com/BlueJayADAL/DS300/blob/master/datasets/lec3_census.sqlite

In [9]:
# Need to place the census.sqlite database file in the same directory of the notebook
engine = db.create_engine('sqlite:///lec3_census.sqlite')

In [10]:
connection = engine.connect()

In [11]:
metadata = db.MetaData()

In [13]:
census = db.Table('census', metadata, autoload = True, autoload_with = engine)

### 3. Viewing table details

SQLAlchemy can be used to automatically load tables from a database using something called reflection. Reflection is the process of reading the database and building the metadata based on that information.

In [15]:
# Print the column names
census.columns.keys()

['state', 'sex', 'age', 'pop2000', 'pop2008']

In [18]:
# Print full table metadata
metadata.tables['census']

Table('census', MetaData(), Column('state', VARCHAR(length=30), table=<census>), Column('sex', VARCHAR(length=1), table=<census>), Column('age', INTEGER(), table=<census>), Column('pop2000', INTEGER(), table=<census>), Column('pop2008', INTEGER(), table=<census>), schema=None)

### 4. Database querying

Table and MetaData have already been imported. The metadata is available as metadata.

In [19]:
#Equivalent to 'SELECT * FROM census'
query = db.select([census])

ResultProxy: The object returned by the .execute() method. It can be used in a variety of ways to get the data returned by the query.

In [20]:
ResultProxy = connection.execute(query)

ResultSet: The actual data asked for in the query when using a fetch method such as .fetchall() on a ResultProxy.

In [21]:
ResultSet = ResultProxy.fetchall()

In [23]:
type(ResultSet)

list

In [25]:
ResultSet[:3]

[('Illinois', 'M', 0, 89600, 95012),
 ('Illinois', 'M', 1, 88445, 91829),
 ('Illinois', 'M', 2, 88729, 89547)]

Alternatively, you can embed the SQL query into the execution.

In [27]:
ResultProxy = connection.execute("SELECT * FROM census")
ResultProxy.fetchall()[:3]

[('Illinois', 'M', 0, 89600, 95012),
 ('Illinois', 'M', 1, 88445, 91829),
 ('Illinois', 'M', 2, 88729, 89547)]

### 5. Convert Array to DataFrame

In [28]:
df = pd.DataFrame(data=ResultSet, columns=ResultSet[0].keys())

Or in one line.

In [30]:
df.head()

      state sex  age  pop2000  pop2008
0  Illinois   M    0    89600    95012
1  Illinois   M    1    88445    91829
2  Illinois   M    2    88729    89547
3  Illinois   M    3    88868    90037
4  Illinois   M    4    91947    91111

### 6. Filtering data

SQL and SQLAlchemy comparison:

#### Where example
**SQL:**
```
SELECT * FROM census 
WHERE sex = F
```

**SQLAlchemy:**
```
db.select([census]).where(census.columns.sex == 'F')
```

In [34]:
result = connection.execute("SELECT * FROM census WHERE sex = 'F'").fetchall()
result[:3]

[('Illinois', 'F', 0, 85910, 90286),
 ('Illinois', 'F', 1, 84396, 88126),
 ('Illinois', 'F', 2, 84764, 86291)]

In [32]:
query = db.select([census]).where(census.columns.sex == 'F')
result = connection.execute(query).fetchall()
result[:3]

[('Illinois', 'F', 0, 85910, 90286),
 ('Illinois', 'F', 1, 84396, 88126),
 ('Illinois', 'F', 2, 84764, 86291)]

#### In example
**SQL:**
```
SELECT state, sex
FROM census
WHERE state IN (Texas, New York)
```

**SQLAlchemy:**
```
db.select([census.columns.state, census.columns.sex]).where(census.columns.state.in_(['Texas', 'New York']))
```

In [39]:
query = db.select([census.columns.state, census.columns.sex]).where(census.columns.state.in_(['Texas', 'New York']))
result = connection.execute(query).fetchall()
result[:3]

[('New York', 'M'), ('New York', 'M'), ('New York', 'M')]

#### And, Or, Not example
**SQL:**
```
SELECT * FROM census
WHERE state = 'California' AND NOT sex = 'M'
```

**SQLAlchemy:**
```
db.select([census]).where(db.and_(census.columns.state == 'California', census.columns.sex != 'M'))
```

In [37]:
result = connection.execute("SELECT * FROM census WHERE state = 'California' AND NOT sex = 'M'").fetchall()
result[:3]

[('California', 'F', 0, 239605, 274356),
 ('California', 'F', 1, 236543, 269140),
 ('California', 'F', 2, 240010, 262556)]

#### Order By example
**SQL:**
```
SELECT * FROM census
ORDER BY State DESC, pop2000
```

**SQLAlchemy:**
```
db.select([census]).order_by(db.desc(census.columns.state), census.columns.pop2000)
```

In [15]:
query = 
result = 
result[:3]

[('Wyoming', 'M'), ('Wyoming', 'M'), ('Wyoming', 'M')]

In [16]:
query = 
result = 
result[:3]

[('Wyoming', 'M', 84, 490, 643),
 ('Wyoming', 'M', 83, 515, 726),
 ('Wyoming', 'M', 82, 634, 792)]

#### Functions example
**SQL:**
```
SELECT SUM(pop2008)
FROM census
```

**SQLAlchemy:**
```
db.select([db.func.sum(census.columns.pop2008)])
```
other functions include avg, count, min, max…

In [17]:
query = 
result = 
result

400288

In [18]:
query = 
result = 
result

[(153959198, 'F'), (148917415, 'M')]

#### Groupby example
**SQL:**
```
SELECT SUM(pop2008) as pop2008, sex
FROM census
```

**SQLAlchemy:**
```
db.select([db.func.sum(census.columns.pop2008).label('pop2008'), census.columns.sex]).group_by(census.columns.sex)
```

In [19]:
query = 
result = 
result

[(153959198, 'F'), (148917415, 'M')]

#### Distinct example
**SQL:**
```
SELECT DISTINCT state
FROM census
```

**SQLAlchemy:**
```
db.select([census.columns.state.distinct()])
```

In [20]:
query = 
result = 
result[:3]

[('Illinois',), ('New Jersey',), ('District of Columbia',)]

#### Case and Cast
The "case()" expression accepts a list of conditions to match and the column to return if the condition matches, followed by an "else_" if none of the conditions match.
"cast()" function can convert an expression to a particular type

In [21]:
female_pop =

In [22]:
total_pop =

In [23]:
query =

In [24]:
result = 
print(result)

51.09467432293413

### 7. Joining tables

If you have two tables that already have an established relationship, you can automatically use that relationship by just adding the columns we want from each table to the select statement.
```
select([census.columns.pop2008, state_fact.columns.abbreviation])
```

In [25]:
# Load two tables from the database

# census table
census = 

# state_fact table
state_fact =

#### Automatic join

In [26]:
query = 
result = 
df = 
df.columns = 
df.head(5)

   pop2008 abbreviation
0    95012           IL
1    95012           NJ
2    95012           ND
3    95012           OR
4    95012           DC

#### Manual Join

In [27]:
query = 
query = 
results = 
df = 
df.columns = 
df.head(5)

,state,sex,age,pop2000,pop2008,id,name,abbreviation,country,type,...,occupied,notes,fips_state,assoc_press,standard_federal_region,census_region,census_region_name,census_division,census_division_name,circuit_court
0,Illinois,M,0,89600,95012,13,Illinois,IL,USA,state,...,occupied,,17,Ill.,V,2,Midwest,3,East North Central,7
1,Illinois,M,1,88445,91829,13,Illinois,IL,USA,state,...,occupied,,17,Ill.,V,2,Midwest,3,East North Central,7
2,Illinois,M,2,88729,89547,13,Illinois,IL,USA,state,...,occupied,,17,Ill.,V,2,Midwest,3,East North Central,7
3,Illinois,M,3,88868,90037,13,Illinois,IL,USA,state,...,occupied,,17,Ill.,V,2,Midwest,3,East North Central,7
4,Illinois,M,4,91947,91111,13,Illinois,IL,USA,state,...,occupied,,17,Ill.,V,2,Midwest,3,East North Central,7

### 8. Creating and Inserting Data into Tables

By passing the database which is not present, to the engine then sqlalchemy automatically creates a new database.

In [28]:
engine =                               #Create test.sqlite automatically
connection = 
metadata = 

emp = db.Table(
    
    
    
              )

metadata.create_all(engine) #Creates the table

In [29]:
#Inserting record one by one
query = 
ResultProxy = connection.execute(query)

In [30]:
#Inserting many records at ones
query = 
values_list = 
ResultProxy = connection.execute(query,values_list)

In [31]:
results = 


df.head(4)

   Id    name    salary  active
0   1  naveen  100000.0    True
1   2     ram   80000.0   False
2   3  ramesh   70000.0    True
3   1  naveen  100000.0    True

### 9. Updating Data in Databases

Use the following format
```
db.update(table_name).values(attribute = new_value).where(condition)
```

In [32]:
engine = db.create_engine('sqlite:///test.sqlite')
metadata = db.MetaData()
connection = engine.connect()
emp = db.Table('emp', metadata, autoload=True, autoload_with=engine)

In [33]:
results = 
df = 
df.columns = r
df.head(4)

   Id    name    salary  active
0   1  naveen  100000.0    True
1   2     ram   80000.0   False
2   3  ramesh   70000.0    True
3   1  naveen  100000.0    True

In [34]:
# Build a statement to update the salary to 100000
query = 
query = 
results = connection.execute(query)

In [35]:
results = 
df = 
df.columns = 
df.head(4)

   Id    name    salary  active
0   1  naveen  100000.0    True
1   2     ram   80000.0   False
2   3  ramesh   70000.0    True
3   1  naveen  100000.0    True

### 10. Dropping a table

```
table_name.drop(engine) #drops a single table
metadata.drop_all(engine) #drops all the tables in the database
```